worklog/taygeta_nvme_read_stress_v01/mirror_v01/fio_output.txt
taygeta_nvme_read_stress: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
fio-3.36
Starting 1 process

fio: terminating on signal 15
taygeta_nvme_read_stress: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
fio-3.36
Starting 1 process

fio: terminating on signal 15

taygeta_nvme_read_stress: (groupid=0, jobs=1): err= 0: pid=5421: Wed Jul 29 18:28:06 2026
  read: IOPS=6315, BW=6316MiB/s (6623MB/s)(38.2TiB/6346496msec)
    slat (usec): min=14, max=1022, avg=20.75, stdev= 2.01
    clat (usec): min=226, max=52737, avg=5045.77, stdev=1351.60
     lat (usec): min=274, max=52761, avg=5066.52, stdev=1351.45
    clat percentiles (usec):
     |  1.00th=[ 4490],  5.00th=[ 4490], 10.00th=[ 4490], 20.00th=[ 4490],
     | 30.00th=[ 4490], 40.00th=[ 4490], 50.00th=[ 4490], 60.00th=[ 4490],
     | 70.00th=[ 4490], 80.00th=[ 4555], 90.00th=[ 6849], 95.00th=[ 8586],
     | 99.00th=[ 9372], 99.50th=[10159], 99.90th=[12518], 99.95th=[15139],
     | 99.99th=[22152]
   bw (  MiB/s): min= 4179, max= 7034, per=99.92%, avg=6310.84, stdev=908.85, samples=105
   iops        : min= 1254, max= 7108, avg=6316.48, stdev=1197.76, samples=12692
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.02%
  lat (msec)   : 2=0.12%, 4=0.28%, 10=99.03%, 20=0.52%, 50=0.02%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.29%, sys=15.54%, ctx=40063818, majf=0, minf=8213
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=40082629,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=6316MiB/s (6623MB/s), 6316MiB/s-6316MiB/s (6623MB/s-6623MB/s), io=38.2TiB (42.0TB), run=6346496-6346496msec

Disk stats (read/write):
  nvme0n1: ios=320666294/20957, sectors=82088738704/1562920, merge=524/9549, ticks=1577573041/33413, in_queue=1577610383, util=100.00%